Repository: Duy-210898/KpiFinal
Catalog: KpiApplication/Resources/Strings.*.resx
Languages: vi, zh

# AccountDisabled
source: Account has been disabled.
vi: Tài khoản đã bị khóa.
zh: 账户已被禁用。

source: Account Management
vi: Quản lý tài khoản
zh: 账户管理

source: Add New File
vi: Thêm tập tin mới
zh: 添加新文件

source: Adjust Operator
vi: Số người
zh: 调整操作员

# AllProcess
source: All Processes
vi: --Tất cả--
zh: 全部工序

# ArticleName
source: Article No.
vi: Tên Article
zh: 款号

source: Assembly
vi: Thành hình
zh: 组装

source: Bonus Document
vi: Tài liệu tiền thưởng
zh: 奖金文件

source: Cancel
vi: Hủy
zh: 取消

source: Change Password
vi: Đổi mật khẩu
zh: 更改密码

source: Confirm
vi: Xác nhận
zh: 确认

# ConfirmDelete
source: Are you sure you want to delete this?
vi: Bạn có chắc chắn muốn xóa?
zh: 您确定要删除吗？

# ConfirmDelete_Message
source: Are you sure you want to delete file “{0}” from model “{1}”?
zh: 你确定要从型号“{1}”中删除文件“{0}”吗？

# ConfirmDelete_Title
source: Confirm Deletion...
zh: 确认删除...

# ConfirmIncludeTCT
source: Include TCT column in export?
zh: 是否要在导出中包含 TCT 列？

# ConfirmLogout
source: Are you sure you want to log out?
vi: Bạn có chắc chắn muốn đăng xuất?
zh: 您确定要注销吗？

source: Created At
vi: Ngày tạo
zh: 创建时间

source: Created By
vi: Người tạo
zh: 创建者

source: Cutting
vi: Chặt
zh: 裁断

source: Data Status
vi: Trạng thái\ndữ liệu
zh: 数据状态

source: Delete
vi: Xoá
zh: 删除

source: Delete Failed
vi: Xóa thất bại
zh: 删除失败

source: Error
vi: Lỗi
zh: 错误

source: Error Details
vi: Chi tiết lỗi
zh: 错误详情

source: Error loading process list.
zh: 加载工序列表出错。

# ErrorWhileDeletingRow
source: ❌ Error occurred while deleting row.
zh: ❌ 删除行时发生错误。

# ErrorWhileSavingDocument
source: Error occurred while saving document.
vi: Lỗi khi lưu tài liệu.
zh: 保存文档时出错。

# Error_MissingDependencies
source: ❌ Missing required dependencies.
zh: ❌ 缺少必要的依赖项。

# Error_UpdateArticleProcess
source: Unable to update process/type data for ArticleID = {0}.
zh: 无法更新 ArticleID = {0} 的工艺/类型数据。

# Error_UpdateModelNameFailed
source: ❌ Failed to update model name.
zh: ❌ 更新型号名称失败。

# Error_UpdateOutsourcing
source: Unable to update outsourcing info for ArticleID = {0}.
zh: 无法更新 ArticleID = {0} 的外协信息。

# Error_UpdatePCIncharge
source: Unable to update person in charge for ArticleID = {0}.
zh: 无法更新 ArticleID = {0} 的负责人。

# Error_UpdateTCT
source: Unable to update TCT data for ArticleID = {0}.
zh: 无法更新 ArticleID = {0} 的 TCT 数据。

source: Exit
vi: Thoát
zh: 退出

source: Export
vi: Xuất Excel
zh: 导出

# ExportCompleted
source: ✅ Excel export completed.
zh: ✅ 成功导出 Excel。

# ExportError
source: Error occurred during export.
zh: 导出过程中发生错误。

# ExportExcelTitle
source: Export to Excel
zh: 导出到 Excel

source: Export failed.
vi: Xuất dữ liệu thất bại
zh: 导出失败

# ExportIEReportFile
source: IE Report
vi: Xuất báo cáo IE
zh: IE 报告

# ExportInsufficientData
source: Insufficient data to export.
zh: 数据不足，无法导出。

# ExportOutputPerLineReportFile
source: Output per Line Report
vi: Xuất báo cáo sản lượng theo chuyền
zh: 各产线产量报告

# ExportShoesKPIReportFile
source: Shoes KPI Report
vi: Xuất báo cáo KPI - Giày
zh: 鞋类 KPI 报告

# ExportSlidesKPIReportFile
source: Slides KPI Report
vi: Xuất báo cáo KPI - Dép
zh: 拖鞋 KPI 报告

# ExportSuccess
source: Export Successful
vi: Xuất dữ liệu thành công
zh: 导出成功

# ExportTCTTitle
source: Export TCT Data to Excel
vi: Xuất dữ liệu TCT thành file Excel
zh: 导出 TCT 数据到 Excel

# Export_UnableToExportTryReorder
source: Unable to export. Please try reordering the data.
zh: 无法导出。请尝试重新排序数据。

# Export_ErrorCreatingFolder
source: Error creating export folder.
zh: 创建导出文件夹出错。

# Export_ErrorGettingDate
source: Error retrieving date.
zh: 获取日期时出错。

# Export_FileNamePrefix
source: Export_
zh: 导出_

# Export_NoMatchingData
source: No matching data found.
zh: 未找到匹配的数据。

# Export_ScanDateColumnMissing
source: Scan Date column missing.
zh: 缺少扫描日期列。

source: Failed to build export data.
zh: 构建导出数据失败。

source: Failed to create Excel file.
zh: 创建 Excel 文件失败。

source: Failed to create report folder.
zh: 无法创建报告文件夹。

source: Failed to open file.
vi: Không thể mở file.
zh: 无法打开文件。

source: File already exists.
vi: Tệp đã tồn tại, vui lòng đổi tên khác.
zh: 文件已存在。

# FileExistsConfirm
source: File already exists. Overwrite?
zh: 文件已存在。是否要覆盖？

# FileLockedOrOpened
source: File is locked or already open.
zh: 文件已锁定或正在被打开。

source: File Name
vi: Tên tệp
zh: 文件名

source: File name cannot be empty.
vi: Tên file không được để trống.
zh: 文件名不能为空。

# FileNameExists
source: File name already exists.
vi: Tên file đã tồn tại.
zh: 文件名已存在。

source: File saved successfully.
vi: File đã được lưu thành công.
zh: 文件保存成功。

source: File updated successfully.
vi: File đã được cập nhật thành công.
zh: 文件更新成功。

source: Final Operator
zh: 最终操作员

source: Guest
vi: Khách
zh: 访客

# GuestLogin
source: Login as Guest
vi: Đăng nhập với tư cách khách
zh: 以访客身份登录

# IncludeTCTInExport
source: Include TCT data in export
vi: Gồm cột TCT khi xuất Excel
zh: 导出中包含 TCT 数据

source: Import
vi: Nhập tệp excel
zh: 导入

source: Import Failed
vi: Nhập dữ liệu thất bại
zh: 导入失败

# ImportSuccess
source: Import Successful
vi: Nhập dữ liệu thành công
zh: 导入成功

source: Importing...
vi: Đang nhập dữ liệu...
zh: 正在导入...

# ImportingDescription
source: Please wait, importing data...
zh: 请稍候，正在导入数据...

source: Importing TCT data...
vi: Đang nhập dữ liệu TCT
zh: 正在导入 TCT 数据...

source: Inserted
vi: Đã thêm mới
zh: 已插入

source: ❌ Invalid Article ID.
zh: ❌ 无效的 Article ID。

source: Invalid file name.
vi: Tên file không hợp lệ.
zh: 文件名无效。

# InvalidFileNameCharacters
source: File name contains invalid characters.
vi: Tên file chứa ký tự không hợp lệ.
zh: 文件名包含无效字符。

# InvalidRow
source: ❌ Invalid row detected.
zh: ❌ 检测到无效行。

source: Language
vi: Ngôn ngữ
zh: 语言

source: Last Updated At
vi: Cập nhật lần cuối
zh: 最后更新时间

# LoadDataError
source: ❌ Error loading data.
zh: ❌ 加载数据时出错。

# LoadDataFailed
source: Failed to load data
vi: Không thể tải dữ liệu
zh: 加载数据失败

source: Loading...
vi: Đang tải...
zh: 加载中...

# LoadingDescription
source: Please wait, loading data...
vi: Vui lòng chờ trong khi dữ liệu đang được tải...
zh: 请稍候，正在加载数据...

source: Loading model names...
vi: Đang tải danh sách hình thể...
zh: 正在加载型号...

source: Login
vi: Đăng nhập
zh: 登录

source: Logout
vi: Đăng xuất
zh: 登出

# MainTitle
source: KPI Management System
vi: Hệ thống quản lý KPI
zh: 绩效管理系统

source: Management
vi: Quản lý hệ thống
zh: 管理部

# ME
source: IE Department
vi: Bộ phận ME
zh: 工艺部

source: ❌ Missing Process or Type ID.
zh: ❌ 缺少 Process 或 Type ID。

source: Model Name
vi: Tên hình thể
zh: 型号名称

source: No data to export.
vi: Không có dữ liệu để xuất
zh: 没有可导出的数据。

source: No file selected
vi: Chưa chọn file nào
zh: 未选择文件

source: No valid data to export.
zh: 没有有效数据可导出。

source: No valid TCT data found.
vi: Không tìm thấy dữ liệu TCT hợp lệ
zh: 未找到有效的 TCT 数据。

source: Note for PC
vi: Ghi chú cho PC
zh: 给 PC 的备注

source: Notes
vi: Ghi chú
zh: 备注

source: Notification
vi: Thông báo
zh: 通知

# OperatorAdjust
source: Adjust Operator
zh: 调整操作员

# OutsourcingAssembling
source: Outsourced Assembly
zh: 外包组装

# OutsourcingStitching
source: Outsourced Stitching
zh: 外包缝纫

# OutsourcingStockFitting
source: Outsourced Stock Fitting
zh: 外包备料仓

source: Password
vi: Mật khẩu
zh: 密码

# PC
source: Production Department
vi: Bộ phận Sinh Quản
zh: 生产部

# PCSend
source: PC Sent
vi: PC yêu cầu
zh: PC 发送

source: Person in Charge
vi: Người phụ trách
zh: 负责人

source: Please enter username before changing password!
vi: Vui lòng nhập tên đăng nhập trước khi đổi mật khẩu
zh: 更改密码前请先输入用户名！

source: Process
vi: Công đoạn
zh: 工序

source: ❌ Process ID not found.
zh: ❌ 未找到 Process ID。

source: Production Sign
vi: Ký sản xuất
zh: 生产标识

source: Read-Only
vi: Chỉ đọc
zh: 只读

source: Reference Model
zh: 参考款式

source: Reference Operator
zh: 参考操作员

source: Refreshing...
vi: Đang làm mới...
zh: 正在刷新...

# RefreshingBonusDocData
source: Refreshing bonus document data...
vi: Đang làm mới dữ liệu tài liệu thưởng...
zh: 正在刷新奖励文档数据...

source: Refreshing bonus documents...
vi: Đang làm mới tài liệu...
zh: 正在刷新奖金文档...

source: Refreshing data...
vi: Làm mới dữ liệu...
zh: 正在刷新数据...

# RememberMe
source: Remember Account
vi: Lưu thông tin đăng nhập
zh: 记住账户

source: Rename Failed.
vi: Đổi tên thất bại.
zh: 重命名失败。

# RenameSuccess
source: Rename Successful.
vi: Đổi tên thành công.
zh: 重命名成功。

# ReportExportSuccess
source: Report exported successfully.
zh: 报告导出成功。

source: Required
vi: không được để trống!
zh: 必填

# RequiredBeforeChangePassword
source: Please enter username before changing password!
vi: Vui lòng nhập tên đăng nhập trước khi đổi mật khẩu.
zh: 更改密码前请先输入用户名！

# RestartNotice
source: Application needs to restart after changing language.
vi: Vui lòng khởi động lại ứng dụng để áp dụng thay đổi.
zh: 更改语言后需要重新启动应用程序。

source: Rows
vi: dòng
zh: 行

# SaveDataError
source: ❌ Error saving data.
zh: ❌ 保存数据时出错。

# SaveFileFailed
source: Failed to save file
vi: Lưu file thất bại
zh: 保存文件失败

source: Scan date not found.
zh: 找不到扫描日期。

source: -- Select Model --
vi: -- Chọn hình thể --
zh: -- 选择型号 --

# SelectModelFirst
source: Please select a model first.
vi: Vui lòng chọn Model trước.
zh: 请先选择型号。

source: Shared Data
vi: Dữ liệu chia sẻ
zh: 共享数据

# SheetSelect
source: Select Worksheet
vi: Chọn sheet
zh: 选择工作表

source: Show
vi: Hiển thị
zh: 显示

source: Skipped Rows
vi: Dòng bị bỏ qua
zh: 已跳过的行

source: Stitching
vi: May
zh: 缝纫

source: Stock Fitting
vi: Dán đế
zh: 备料

source: Success
vi: Thành công
zh: 成功

# SupportedFiles
source: Only PDF or image files (JPG, PNG, BMP) are supported.
vi: Chỉ hỗ trợ tập tin PDF hoặc hình ảnh (JPG, PNG, BMP).
zh: 仅支持 PDF 或图像文件（JPG、PNG、BMP）。

source: Target Output
vi: Sản lượng\nmục tiêu
zh: 目标产量

source: TCT Data
vi: Dữ liệu TCT
zh: TCT 数据

# TooltipTemplate_FileInfo
source: 📄 File Name: {0}\n🕒 Created: {1:yyyy-MM-dd}\n👤 Created by: {2}
vi: 📄 Tên file: {0}\n🕒 Ngày tạo: {1:yyyy-MM-dd}\n👤 Người tạo: {2}
zh: 📄 文件名: {0}\n🕒 创建时间: {1:yyyy-MM-dd}\n👤 创建人: {2}

# TooltipTemplate_UpdatedInfo
source: \n✏️ Updated on: {0:yyyy-MM-dd}\n👤 Updated by: {1}
vi: \n✏️ Cập nhật lúc: {0:yyyy-MM-dd}\n👤 Người cập nhật: {1}
zh: \n✏️ 更新于: {0:yyyy-MM-dd}\n👤 更新人: {1}

source: Total TCT
vi: TCT Tổng
zh: TCT总计

source: Type
vi: Giai đoạn
zh: 类型

source: ❌ Type ID not found.
zh: ❌ 未找到 Type ID。

# UnexpectedError
source: An unexpected error occurred.
zh: 发生未知错误。

source: Update
zh: 更新

source: Update Failed
vi: Cập nhật thất bại
zh: 更新失败

# UpdateSuccess
source: Update Successful
vi: Cập nhật thành công
zh: 更新成功

source: Updated
vi: Đã cập nhật
zh: 已更新

source: Updated At
vi: Ngày cập nhật
zh: 更新时间

source: Updated By
vi: Người cập nhật
zh: 更新者

source: Username
vi: Tên đăng nhập
zh: 用户名

source: Username does not exist.
vi: Tên đăng nhập không tồn tại
zh: 用户名不存在。

# UsernameNotExists
source: Username does not exist.
vi: Tên đăng nhập không tồn tại.
zh: 用户名不存在。

source: User not found.
vi: Không tìm thấy người dùng.
zh: 找不到用户。

source: View Bonus Documents
vi: Xem tài liệu tiền thưởng
zh: 查看奖金文件

source: View Daily Data
vi: Xem dữ liệu hàng ngày
zh: 查看日数据

source: View IE PPH
vi: Xem chỉ số IE PPH
zh: 查看 IE PPH

source: View TCT Data
vi: Xem dữ liệu TCT
zh: 查看 TCT 数据

source: Warning
vi: Cảnh báo
zh: 警告

source: Weekly Plan
vi: Kế hoạch tuần
zh: 周计划

source: Working Time
vi: Thời gian làm việc
zh: 上班时间

# WrongPassword
source: Incorrect password.
vi: Mật khẩu không đúng.
zh: 密码错误。

# ZoomPercent
source: Zoom: {0}%
zh: 缩放：{0}%

# Saving
source: Saving data
zh: 正在保存...

source: Excel Export Options
vi: Tùy chọn xuất Excel
zh: Excel 导出选项

# SearchIEPPH
source: IE PPH Management
vi: Chỉ số IE PPH
zh: IE PPH管理

source: Refresh
vi: Làm mới
zh: 刷新

# RefreshingDescription
source: Please wait, refreshing data...
vi: Vui lòng chờ, đang làm mới dữ liệu...
zh: 请稍候，正在刷新数据…

source: Export File
vi: Xuất file...
zh: 导出文件

source: Plant
vi: Xưởng
zh: 工厂
